---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.SetUp
source: html/158723ab-631f-05b6-48d2-75cd9aa0edf0.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.SetUp Property

The abbreviation of the Set Up from top (TU) of fitting string.

## Syntax (C#)
```csharp
public string SetUp { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null